Tekla Open API Reference for Tekla Structures 2025
CustomPart.Modify Method
 Modifies the existing custom part in the model database to match the current one.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
True on success.
Remarks
Currently position attributes cannot be changed with Modify().
See Also
Reference
CustomPart Class
Tekla.Structures.Model Namespace